/* 游戏数据 */

/******************* 显示效果 ******************** */
// 移动定时器的间隔：决定每秒刷新次数 刷新对象的实时位置信息
const moveTime = 20;
// 显示定时器的间隔：决定每秒刷新次数 60FPS：1000/60=16.6ms  设置为16ms
const showTime = 17;

/******************* 地图 ******************** */
// 地图移动速度（飞机默认的移动速度）
let mapSpeed = 200;

/******************* 主机 ******************** */
// 主机的移动速度
let airSpeed = 5;
// 主机子弹的速度
let bulletSpeed = 6;

// 主机子弹创建定时器的间隔：决定每秒创建次数
let bulletTime = 300;

/******************* 敌机组1 ******************** */
// 敌机组1的移动速度
let enemyAirSpeed = 2;
// 敌机组1子弹的速度
let enemyBulletSpeed = 6;

// 子弹创建定时器的间隔：决定每秒创建次数
let enemyBulletTime = 4000;
// 飞机创建定时器的间隔：决定每秒创建次数
let enemyAirTime = 5000;

/******************* 敌机A ******************** */
// 飞机的移动速度
let enemyAirSpeedA = 2;
// 子弹的速度
let enemyBulletSpeedA = 6;

// 子弹创建定时器的间隔：决定每秒创建次数
let enemyBulletTimeA = 2000;
// 飞机创建定时器的间隔：决定每秒创建次数
let enemyAirTimeA = 6000;

/*********************************************** */
setInterval(() => {
    enemyAirTime -= 500;
    enemyAirTimeA -= 500;
},10000);